In [3]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

from pydataset import data

import warnings
warnings.filterwarnings('ignore')

from env import host, user, password

In [5]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [8]:
def get_url(username, hostname, password, database):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

In [13]:
get_url(username=user, hostname=host, password=password, database='employees')
url
print('hide get_url function results')

hide get_url function results

In [14]:
pd.read_sql('SELECT * FROM employees LIMIT 200', url)

     emp_no  birth_date first_name     last_name gender   hire_date
0     10001  1953-09-02     Georgi       Facello      M  1986-06-26
1     10002  1964-06-02    Bezalel        Simmel      F  1985-11-21
2     10003  1959-12-03      Parto       Bamford      M  1986-08-28
3     10004  1954-05-01  Chirstian       Koblick      M  1986-12-01
4     10005  1955-01-21    Kyoichi      Maliniak      M  1989-09-12
..      ...         ...        ...           ...    ...         ...
195   10196  1954-01-27       Marc    Hellwagner      M  1994-11-16
196   10197  1963-08-06    Kasidit  Krzyzanowski      F  1993-11-22
197   10198  1953-05-28     Pranav        Furedi      M  1985-08-31
198   10199  1959-04-07   Kazuhisa         Ranta      M  1997-04-29
199   10200  1961-12-31      Vidya         Awdeh      M  1985-10-16

[200 rows x 6 columns]